---
kind: type
id: T:Autodesk.Revit.DB.ColorDepthType
source: html/68f2abd4-0f9c-01c0-47da-e228518f7d37.htm
---
# Autodesk.Revit.DB.ColorDepthType

An enumerated type listing all Color Depth types of Print Setting.

## Syntax (C#)
```csharp
public enum ColorDepthType
```